app/views/books/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
        <td><%= x.isbn %></td>
        <td><%= @users.find_by_id(x.user).name unless @users.find_by_id(x.user).nil?%></td>