app/controllers/books_controller.rb

    def index
        @users = User.all
        @books = Book.search(params[:search])
---
SELECT "users".* FROM "users"
SELECT "books".* FROM "books" WHERE (title LIKE '%Swamp Living for Dummies%')  ORDER BY "books"."id" DESC

    def home
        @books = Book.all()
        @books.order(:timestamps)
        @users = User.all
---
SELECT "books".* FROM "books"  ORDER BY "books"."id" DESC
SELECT "books".* FROM "books"  ORDER BY "books"."timestamps" ASC
SELECT "users".* FROM "users"

    def destroy
        Book.find(params[:id]).destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]

    def create
        @books = Book.new(m_params)
        @books.user = current_user

        if @books.save
---
INSERT INTO "books" ("title", "isbn", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "The Three Body Problem"], ["isbn", "1234"], ["price", "10"], ["user_id", 3], ["created_at", "2018-11-19 21:55:19.765971"], ["updated_at", "2018-11-19 21:55:19.765971"]]

    def show
        @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 0]]