app/controllers/sessions_controller.rb

  def create
    user = User.find_by(name: params[:session][:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["name", "shees"]]