app/controllers/users_controller.rb

    def uindex
		@users = User.all
---
SELECT "users".* FROM "users"

    def create
        @user = User.new(u_params)

        if @user.save
---
INSERT INTO "users" ("name", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Shees "], ["phone", "321312312"], ["created_at", "2018-10-29 15:23:32.797273"], ["updated_at", "2018-10-29 15:23:32.797273"]]

	def profile
	    @users = User.includes(:books)
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]

	def show
  	    @users = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]